
// !Напиши всі можливі варіанти створення функцій.
// function get() { };
// let a = function () { };
// let b = (a, b) => выражение;


// ---------------------------------------------------------------------
//! Створи функцію, яка буде виводити кількість переданих їй аргументів.

console.log((function(a, b, c, d, i) {}).length); 

// ---------------------------------------------------------------------
// !Напиши функцію, яка приймає 2 числа і повертає :
// !-1, якщо перше число менше, ніж друге; 
// !1 - якщо перше число більше, ніж друге; 
//! 0 - якщо числа рівні.

function operation(a, b)
{ if (a < b){
    return -1;
}
else if (a > b) {
    return 1;
   }
    
else if (a == b) {
    return 0;
   }
    
}
alert(operation(4, 1));
// ---------------------------------------------------------------------------

//! Напиши функцію, яка обчислює факторіал переданого їй числа.
function fact(a) {
    let factorial = 1
    for (i = 1; i <= a; i++){
        factorial*=i
    }
    return factorial;
}
alert(fact(4));

// -------------------------------------------------------------------------------
// !Напиши функцію, яка приймає три окремі цифри і перетворює їх в одне число.
// !    Наприклад: цифри 1, 4, 9 перетворяться в число 149.
let masiv = [4, 5, 6]
function combinationOfNumbers (m) {
    let combination = m.join('')
    return combination
}
alert(combinationOfNumbers(masiv));

// -----------------------------------------------------------------------------------

//! Напиши функцію, яка приймає довжину і ширину прямокутника і обчислює його площу.
// ! Якщо в функцію передали 1 параметр, то вона обчислює площу квадрата.

function square(a, b) {
    if (a, b){
    let squareRectangle = a * b
    return squareRectangle}
    else {
        if (b == undefined) {
            let squareArea = a * a
            return squareArea
                }
         }
    }

alert(square(3, 5));
alert(square(3));
// --------------------------------------------------------------------------------------------

// !Напиши функцію, яка перевіряє, чи є передане їй число “досконалим числом”.
// ! Досконале число - це число, яке дорівнює сумі всіх своїх дільників.

function perfectNumber(a) {
    let aaaa = 0;
for (let i = 1; i <= a/2; i++) {
    if (a % i === 0){
        aaaa += i
        }
    }
    if (aaaa === a) { 
        // console.log('Число досконале'); 
        return true;
    } else {
        // console.log('Число не досконале'); 
        return false;
    }
}
perfectNumber(6);

// ---------------------------------------------------------------------------------------------
// !Напиши функцію, яка приймає мінімальне і максимальне значення для діапазону, і виводить
// ! тільки ті числа з діапазону, які є досконалими.Використовуй написану раніше функцію,
// !щоб дізнатися, чи є це число досконалим

function s(min, max) { 
    let aa = [];
    for (let i = min; i <= max; i++) {
        if (perfectNumber(i)) {
            aa.push(i)
        }
    }
    alert(aa);
        
    }
s(2, 1000);

